htmlized-src/author2.org.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.34 in css mode. -->
<html>
  <head>
    <title>author2.org</title>
  </head>
  <body>
    <pre>
<span class="comment"># -*- coding:utf-8 -*-</span>
<span class="org-meta-line">#+LANGUAGE:  zh
</span><span class="org-document-info-keyword">#+TITLE:</span><span class="comment">     </span><span class="org-document-title">&#32426;&#31168;&#23792;_&#20010;&#20154;&#31616;&#21382;(Java)</span>
<span class="org-document-info-keyword">#+AUTHOR:</span><span class="comment">    </span><span class="org-document-info">&#32426;&#31168;&#23792;</span>
<span class="org-document-info-keyword">#+EMAIL:</span><span class="comment">     </span><span class="org-document-info">jixiuf@gmail.com</span>
<span class="org-document-info-keyword">#+DATE:</span><span class="comment">     </span><span class="org-document-info">2012-03-14 &#19977;</span>
<span class="org-meta-line">#+DESCRIPTION:&#20010;&#20154;&#31616;&#21382;
#+KEYWORDS: &#20010;&#20154;&#31616;&#21382;
#+OPTIONS:   H:2 num:nil toc:nil \n:t @:t ::t |:t ^:nil -:t f:t *:t &lt;:t
#+FILETAGS:
</span><span class="org-level-1">* Word &#29256;&#31616;&#21382;</span>
+  <span class="org-link">&#32426;&#31168;&#23792;_Java.doc</span>
<span class="org-level-1">* &#22522;&#26412;&#20449;&#24687;</span>
  <span class="org-table">|------------+--------------------|</span>
  <span class="org-table">| &#30005;    &#35805;   | 13522419247&#12288;      |</span>
  <span class="org-table">| &#20986;&#29983;&#24180;&#26376;   | 1989-01            |</span>
  <span class="org-table">| E-mail     | jixiuf@qq.com&#12288;    |</span>
  <span class="org-table">| &#33521;&#35821;&#27700;&#24179;   | &#20845;&#32423;460            |</span>
  <span class="org-table">| &#35777;    &#20070;   | &#25968;&#25454;&#24211;&#19977;&#32423;         |</span>
  <span class="org-table">| &#27605;&#19994;&#38498;&#26657;   | &#38738;&#23707;&#31185;&#25216;&#22823;&#23398;       |</span>
  <span class="org-table">| &#23398;    &#21382;   | &#26412;&#31185; 2007-9~2011-7 |</span>
  <span class="org-table">| &#25143;&#21475;&#25152;&#22312;&#22320; | &#23665;&#19996;&#38738;&#23707;           |</span>
  <span class="org-table">| &#29616;&#23621;&#20303;&#22320;   | &#21271;&#20140;&#28023;&#28096;&#21306;         |</span>
<span class="org-level-1">* &#25321;&#19994;&#30446;&#26631;&#65306;</span>
  + Java&#31243;&#24207;&#21592;&#12288;    &#22522;&#20110;Web&#24212;&#29992;&#30340;Java&#36719;&#20214;&#24320;&#21457;&#12290;
<span class="org-level-1">* &#33258;&#25105;&#20171;&#32461;&#65306;</span>
csdn&#21338;&#23458;&#65306;            <span class="org-link">http://blog.csdn.net/jixiuffff</span>
&#20010;&#20154;&#20027;&#39029;:              <span class="org-link">http://jixiuf.github.com/sitemap.html</span>
EmacsWiki&#20010;&#20154;&#20027;&#39029;&#65306;  <span class="org-link">http://emacswiki.org/Joseph</span>
&#33258;&#23398;&#33021;&#21147;&#24378;&#65292;&#25152;&#26377;&#35745;&#31639;&#26426;&#30693;&#35782;&#22343;&#20026;&#33258;&#23398;&#12290;&#20197;&#19978;&#20960;&#20010;&#32593;&#22336;&#26159;&#20010;&#20154;&#25104;&#26524;&#30340;&#23637;&#31034;&#65292;
EmacsWiki&#20010;&#20154;&#20027;&#39029;:&#20026;&#25105;&#20026;Emacs&#24320;&#28304;&#31038;&#21306;&#36129;&#29486;&#30340;&#20195;&#30721;&#12290;
<span class="org-level-1">* &#19987;&#19994;&#25216;&#33021;&#65306;</span>
+ &#31934;&#36890;&#22522;&#20110;Web&#24212;&#29992;&#30340;JAVA&#32534;&#31243;&#65306; JSP/Servlet JSTL JDBC &#65307;
+ &#31934;&#36890;Struts1 Struts2 Hibernate Spring(AOP,IOC)&#31561;&#26694;&#26550;&#30340;&#20351;&#29992;&#65307;
+ &#29087;&#24713;JPA EJB3 JMS  JavaMail&#30340;&#20351;&#29992;&#12290;
+ &#29087;&#32451;&#20351;&#29992;Lucene Compass &#31561;Java&#25628;&#32034;&#30456;&#20851;&#26694;&#26550;&#30340;&#20351;&#29992;&#21450;&#19982; Hibernate Spring &#26694;&#26550;&#30340;&#25972;&#21512;&#12290;
+ &#29087;&#32451;&#20351;&#29992;SVN&#12289; Git&#31561;&#29256;&#26412;&#31649;&#29702;&#24037;&#20855;&#65307;
+ &#29087;&#32451;&#20351;&#29992;Maven Nexus &#23545;&#39033;&#30446;&#36827;&#34892;&#31649;&#29702;&#65307;
+ &#29087;&#32451;&#22312;&#22522;&#20110;Windows, Linux(Gentoo&#65292;redhat) &#29615;&#22659;&#19979;&#36827;&#34892;Java&#36719;&#20214;&#24320;&#21457;,&#20559;&#29233;Linux&#65307;
+ &#25484;&#25569;&#22522;&#20110;Oracle&#30340;&#25968;&#25454;&#24211;&#32534;&#31243;&#65306;JDBC &#12289; PLSQL&#65307;
+ &#29087;&#32451;&#25484;&#25569;Html JavaScript/AJAX Jquery&#23458;&#25143;&#31471;&#20195;&#30721;&#30340;&#32534;&#20889;;&#20102;&#35299;Extjs&#12289; Flex&#12289; DWR  &#30340;&#20351;&#29992;;
+ &#29087;&#32451;&#20351;&#29992;MyEclipse,Eclipse ,&#31561; &#38598;&#25104;IDE&#24037;&#20855;,&#21450;Linux  &#19979;Vim&#12289;Emacs &#32534;&#36753;&#22120;&#65307;
+ &#29087;&#32451;&#24212;&#29992;&#22810;&#31181;JAVA&#26381;&#21153;&#22120;,&#21253;&#25324; JBoss&#65292;Apache Tomcat &#65307;
<span class="org-level-1">* &#24320;&#21457;&#32463;&#39564;&#65306;</span>
<span class="org-level-2">**      &#28023;&#21326;&#29983;&#20135;&#31649;&#29702;&#31995;&#32479;(2011-7~2011-11)</span>
    &#20026;&#38738;&#23707;&#28023;&#21326;&#32420;&#32500;&#26377;&#38480;&#20844;&#21496;&#65288;&#20027;&#35201;&#29983;&#20135;&#20551;&#21457;&#30340;&#21322;&#25104;&#21697;&#65289;&#32534;&#20889;&#29983;&#20135;&#31649;&#29702;&#31995;&#32479; &#12290;&#20027;&#35201;&#20998;&#20026;&#19977;&#22823;&#27169;&#22359;&#65306;
1. &#25968;&#25454;&#25910;&#38598;&#27169;&#22359;&#20027;&#35201;&#36890;&#36807;PDA(&#25484;&#19978;&#30005;&#33041;)&#26465;&#30721;&#25195;&#25551;&#22120;&#20174;&#21508;&#34955;&#21322;&#21046;&#21697;&#19978;&#30340;&#26465;&#30721;&#19978;&#25195;&#25551;&#24471;&#21040;&#25968;
      &#25454;(&#36827;&#34892;&#30424;&#28857;)&#12289;&#20197;&#21450;&#36827;&#34892;&#20837;&#24211;&#12289;&#20986;&#24211;&#25805;&#20316;&#12290;
2. PC &#31471;&#65292;&#20063;&#21516;&#26102;&#21487;&#20197;&#36827;&#34892;&#20837;&#24211;&#12289;&#20986;&#24211;&#12289;&#25968;&#25454;&#32479;&#35745;&#12289;&#30424;&#28857;&#12289;&#26465;&#24418;&#30721;&#25171;&#21360;&#31561;&#25805;&#20316;&#12290;PC&#31471; &#20027;&#35201;
      &#20351;&#29992;C#&#12289;Silverlight WCF &#31561;&#25216;&#26415;&#65292;&#21518;&#21488;&#25968;&#25454;&#24211;&#29992;SQL Server 2008&#12290; &#21069;&#21488;&#30028;&#38754;&#20351;
      &#29992;Silverlight&#27169;&#20223;Window7 &#25805;&#20316;&#31995;&#32479;&#65292;&#20027;&#35201;&#23454;&#29616;&#20102;&#29992;&#25143;&#26435;&#38480;&#25511;&#21046;&#12289;&#21322;&#21046;&#21697;&#65288;&#20998;&#20026;4
      &#20010;&#31867;&#20284;&#27169;&#22359;:&#21322;&#21046;&#21697;&#20179;&#24211;&#12289;&#20013;&#38388;&#20179;&#24211;&#12289;&#28748;&#22721;&#20179;&#24211;&#12289;&#31881;&#30862;&#19997;&#20179;&#24211;&#65289;&#20998;&#21035;&#26377;&#20837;&#24211;&#12289;&#20986;&#24211;&#12289;
      &#32479;&#35745;&#12289;&#30424;&#28857;&#31561;&#21151;&#33021;&#12290;
3. &#26465;&#24418;&#30721;&#30340;&#29983;&#25104;&#36890;&#36807;&#35843;&#29992;TSC dll&#30340;&#25171;&#21360;&#21151;&#33021;&#23454;&#29616;&#12290;&#25171;&#21360;&#27169;&#22359;&#21508;&#29420;&#20570;&#25104;&#19968;&#20010;&#26381;&#21153;&#65292;&#25918;&#22312;&#26381;
      &#21153;&#22120;&#19978;&#65292;&#26080;&#35770;&#26159;&#25195;&#25551;&#22120;&#31471; &#12289;&#36824;&#26159;PC&#31471;&#37117;&#21487;&#20197;&#36828;&#31243;&#35843;&#29992;&#25171;&#21360;&#26426;&#36827;&#34892;&#26465;&#24418;&#30721;&#30340;&#25171;&#21360;
4. &#25105;&#20027;&#35201;&#36127;&#36131;&#30340;tsc&#26465;&#30721;&#25171;&#21360;&#26381;&#21153;&#30340;&#32534;&#20889;&#12289;&#21450;&#26465;&#24418;&#30721;&#25195;&#25551;&#22120;&#31471;3&#20010;&#20986;&#24211;&#30011;&#38754;&#12289;&#21322;&#21046;&#21697;&#30424;&#28857;&#12289;
   &#28748;&#22721;&#30424;&#28857;)(&#28748;&#22721;&#20837;&#24211;)&#12289; &#31561;&#22810;&#20010;&#30011;&#38754;&#12290;PC&#31471;&#36127;&#36131;1&#20010;&#30424;&#28857;&#30011;&#38754;(&#21322;&#21046;&#21697;&#30424;&#28857;)&#12289;3&#20010;&#20986;&#24211;&#30011;
   &#38754;(&#20013;&#38388;&#20179;&#24211;&#20986;&#24211;&#12289;&#28748;&#22721;&#20986;&#24211;&#12289; &#31881;&#30862;&#19997;&#20986;&#24211;&#12289;)&#12289;&#21450;&#21322;&#21046;&#21697;&#30340;&#31649;&#29702;(&#26032;&#22686;&#12289;&#26356;&#26032;&#12289;&#20923;&#32467;&#12289;
   &#21021;&#22987;&#21270;&#24211;&#23384;)&#31561;&#25805;&#20316;&#12290;

<span class="org-level-2">**   &#20462;&#25913;&#24182;&#23436;&#21892; Eclipse&#25554;&#20214; EasyExplore (&#22312;&#26657;&#26399;&#38388;)</span>
     easyExplore &#26159;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#65292;&#20027;&#35201;&#23454;&#29616;&#20102;&#29992;&#25991;&#20214;&#31649;&#29702;&#22120;&#25171;&#24320;&#22312;eclipse&#20013;&#36873;&#20013;&#30340;&#30446;
&#24405;,&#19981;&#36807;&#24050;&#32463;&#20572;&#27490;&#24320;&#21457;&#20102;&#12290;&#32780;&#25105;&#19979;&#36733;&#20102;&#23427;&#30340;&#28304;&#20195;&#30721;&#21518;&#28155;&#21152;&#20102;&#20004;&#39033;&#21151;&#33021;&#65292;&#19968;&#26159;&#28155;&#21152;&#20102;&#29992;&#31995;&#32479;&#32534;
&#36753;&#22120;&#32534;&#36753;eclipse&#20013;&#36873;&#20013;&#30340;&#25991;&#20214;&#65292;&#24403;&#32534;&#36753;&#23436;&#36825;&#20010;&#25991;&#20214;&#12289;&#20851;&#38381;&#32534;&#36753;&#22120;&#26102;,eclipse&#20250;&#21047;&#26032;&#25972;&#20010;&#39033;
&#30446;&#24182;&#37325;&#26032;&#32534;&#35793;&#65292;&#20197;&#23454;&#29616;eclipse&#39033;&#30446;&#21516;&#25991;&#20214;&#31995;&#32479;&#19978;&#25991;&#20214;&#30340;&#21516;&#27493;;&#21478;&#19968;&#20010;&#21151;&#33021;&#26159;&#22312;&#36873;&#20013;&#30340;&#30446;&#24405;
&#22788;&#25171;&#24320;Linux&#30340;&#32456;&#31471;&#27169;&#25311;&#22120;&#25110;&#32773;Windows&#30340;cmd.exe&#31383;&#21475;&#65292;&#21487;&#20197;&#36890;&#36807;&#24037;&#20855;&#26639;&#12289;&#21491;&#38190;&#12289;&#24555;&#25463;&#38190;&#36827;
&#34892;&#25805;&#20316;&#12290;&#28304;&#20195;&#30721;&#20351;&#29992;Git&#36827;&#34892;&#29256;&#26412;&#25511;&#21046;,&#25176;&#31649;&#22312;
<span class="org-link">http://github.com/jixiuf/easyexplore_modify_by_jixiuf</span>&#12290;
<span class="org-level-2">**  DRP&#20998;&#38144;&#36164;&#28304;&#31649;&#29702;&#31995;&#32479;</span>
       &#35813;&#39033;&#30446;&#20351;&#20225;&#19994;&#20855;&#26377;&#23545;&#35746;&#21333;&#21644;&#20379;&#36135;&#20855;&#26377;&#24555;&#36895;&#21453;&#24212;&#21644;&#25345;&#32493;&#34917;&#20805;&#24211;&#23384;&#30340;&#33021;&#21147;&#12290;&#20027;&#35201;&#21253;&#25324;&#20998;
&#38144;&#24211;&#23384;&#31649;&#29702;&#65292;&#32479;&#35745;&#25253;&#34920;&#31649;&#29702;&#12289;&#22522;&#30784;&#25968;&#25454;&#31649;&#29702;&#12289;&#20998;&#38144;&#36153;&#31649;&#29702;&#12289;&#20184;&#27454;&#32467;&#31639;&#31649;&#29702;&#31561;&#20960;&#20010;&#27169;&#22359;&#12290;&#25105;
&#20027;&#35201;&#21442;&#19982;&#20102;&#20854;&#20013;&#22522;&#30784;&#25968;&#25454;&#30340;&#31649;&#29702;&#65292;&#20998;&#38144;&#21830;&#24211;&#23384;&#31649;&#29702;&#21450;&#37096;&#20998;&#25253;&#34920;&#30340;&#29983;&#25104;&#12290;&#37319;&#29992;Tomcat +
Oracle+Struts2+Hibernate+Spring+JQuery&#24179;&#21488;&#65292;&#21069;&#26399;&#22312;Gentoo Linux&#24179;&#21488;&#19978;&#36827;&#34892;&#24320;&#21457;&#65292;
&#21518;&#26399;&#36807;&#31243;&#20013;&#35201;&#29992;&#21040;jacob &#36890;&#36807;jni&#35843;&#29992;&#29983;&#25104;Word&#25991;&#26723;&#24418;&#24335;&#30340;&#25253;&#34920; ,&#27492;&#37096;&#20998;&#22312;Windows XP &#31995;
&#32479;&#19978;&#20570;&#20102;&#27979;&#35797;,&#21478;&#22806;&#20351;&#29992;&#20102;JFreeChart&#25253;&#34920;&#24037;&#20855;&#29983;&#25104;&#26609;&#29366;&#22270;&#39292;&#22270;&#31561;&#12290;&#24211;&#23384;&#31649;&#29702;&#12290; &#31995;&#32479;&#21551;&#29992;
&#21518;&#65292;&#20027;&#35201;&#23601;&#26159;&#29289;&#26009;&#30340;&#20986;&#20837;&#24211;&#12289;&#24211;&#23384;&#35843;&#25972;&#36807;&#31243;&#12290;&#21518;&#32773;&#30340;&#25805;&#20316;&#27493;&#39588;&#20026;&#65306;&#21830;&#21153;&#20027;&#31649;&#25910;&#38598;&#27969;&#21521;&#21333;&#65307;
&#25968;&#25454;&#24405;&#20837;&#21592;&#24405;&#20837;&#27969;&#21521;&#21333;&#25968;&#25454;&#65307;&#21830;&#21153;&#20027;&#31649;&#23457;&#26680;&#65288;&#22914; &#26377;&#25968;&#37327;&#24046;&#24322;&#65292;&#21487;&#20197;&#20462;&#25913;&#35843;&#25972;&#39033;&#25968;&#25454;&#65289; &#65307;
&#21830;&#21153;&#32463;&#29702;&#23457;&#26680;&#30830;&#35748;&#65288;&#22914;&#26524;&#26377;&#38382;&#39064; &#65292;&#39539;&#22238;&#65292;&#27491;&#30830;&#30340;&#35805;&#23601;&#30452;&#25509;&#20914;&#20943;&#24211;&#23384;&#65289;&#12290;&#25972;&#20010;&#31995;&#32479;&#30028;&#38754;&#36890;&#36807;
&#20280;&#32553;&#33756;&#21333;&#36827;&#34892;&#31649;&#29702;&#65288;&#20351;&#29992;jquery&#33258;&#24049;&#23454;&#29616;&#65289;&#12290;&#28304;&#20195;&#30721;&#25176;&#31649;
&#22312;: <span class="org-link">https://github.com/jixiuf/drp</span>
&#24320;&#21457;&#29615;&#22659;&#65306;
Gentoo Linux ,Windows XP
JAVA&#24212;&#29992;&#26381;&#21153;&#22120;&#65306; Tomcat&#65307;
&#24320;&#21457;&#35821;&#35328;&#21450;&#25216;&#26415;&#65306; Jsp,Struts2 , Hibernate ,Spring,JQuery&#65307;
&#25968;&#25454;&#24211;&#65306;Oracle10g&#12290;
</pre>
  </body>
</html>
